{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "How much can you realistically save on Azure costs?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "A phased approach typically achieves 10-15% savings in months 3-4 through quick wins like deleting orphaned disks and auto-shutting dev VMs, 20-30% cumulative savings by months 5-6 through strategic optimization, and 30-40% sustained savings from month 7 onward with continuous governance."
      }
    },
    {
      "@type": "Question",
      "name": "What are the five phases of Azure cost optimization?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "The five phases are: (1) Establish Baseline to understand current spend over weeks 1-2, (2) Tag Everything to add business context in weeks 3-4, (3) Context-Aware Analysis to find optimization targets in weeks 5-6, (4) Optimization Execution to implement changes on an ongoing basis, and (5) Continuous Governance to prevent cost regression. Phases 1-2 produce zero savings but are mandatory."
      }
    },
    {
      "@type": "Question",
      "name": "What Azure tags are required for cost optimization?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Every resource needs six minimum tags: Environment (Production, UAT, Dev, DR), CostCenter (for chargeback), Owner (email of responsible person), Application (groups related resources), Criticality (Tier1, Tier2, Tier3 for SLA definitions), and EOL (end-of-life date or Permanent)."
      }
    },
    {
      "@type": "Question",
      "name": "How do you find and eliminate zombie applications in Azure?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Identify zombie apps by checking for no deployments in 6+ months, no users in access logs, owners who left the company, or temporary dev projects from years ago. Use tags and metrics to identify candidates, email the owner, wait 2 weeks for response, snapshot everything, shut down for 30 days without deleting, and only delete if nobody complains. Savings can be $10,000-$50,000 per month per zombie app."
      }
    },
    {
      "@type": "Question",
      "name": "How much can you save by auto-shutting dev and UAT VMs?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Implementing auto-shutdown schedules for dev and UAT VMs provides approximately 65% savings on compute costs by running 40 hours per week instead of 168 hours. This is achieved by setting nightly shutdown schedules with owner notifications."
      }
    },
    {
      "@type": "Question",
      "name": "Why does following Azure Advisor blindly cause problems?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Azure Advisor lacks business context. It may flag batch processing workloads with CPU spikes, month-end processing that needs peak capacity, or DR/backup disks as optimization candidates. Always check tags, ask resource owners, and test changes in UAT before applying Advisor recommendations to production."
      }
    },
    {
      "@type": "Question",
      "name": "What three things do successful Azure cost optimization programs have?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Successful programs require executive sponsorship with CFO and CTO aligned, business context through comprehensive tagging, and patience with a 6-month roadmap instead of 2-week heroics. Skipping any of these results in either no savings, broken production, or one-time savings that regress."
      }
    }
  ]
}
