{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What should I complete before starting Azure Migrate assessments?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Complete this 55-question pre-migration checklist before Azure Migrate: (1) Application inventory with business owners identified, (2) Vendor contract status and termination clauses for all applications, (3) Licensing audit showing Software Assurance coverage for Windows/SQL, (4) Disaster recovery commitments and SLA requirements documented, (5) True operating costs including hidden support and maintenance contracts, (6) Network dependency mapping for inter-application communication, (7) Compliance requirements (HIPAA, PCI-DSS, SOC 2) by workload, (8) Data residency restrictions and regulatory constraints. Azure Migrate provides technical assessments but cannot answer organizational readiness questions that finance and legal will block your migration over. Most failed migrations spend 3-6 months on Azure Migrate output without answering the CFO's actual question: What's the 3-year TCO versus current datacenter?"
      }
    },
    {
      "@type": "Question",
      "name": "Why do Azure migrations exceed budget and timeline expectations?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Azure migrations exceed budget by 2× and double timelines because organizations start with technical tools (Azure Migrate, CloudEndure) before establishing organizational readiness. Common failures: (1) Discovering application owners don't exist or refuse cloud migration mid-project, (2) Finding vendor contracts require 90-day termination notice after migration planning is complete, (3) Realizing OEM licenses don't transfer to Azure without purchasing new Volume Licenses, (4) Learning applications have undocumented dependencies requiring simultaneous migration, (5) Discovering true operating costs include hidden support contracts not in budgets. Technical assessments are irrelevant if you can't answer 'Who owns this application and will they support it in Azure?' Executive leadership blocks migrations when business questions remain unanswered after months of technical planning."
      }
    },
    {
      "@type": "Question",
      "name": "What questions do CFOs ask about Azure migration that Azure Migrate cannot answer?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "CFOs ask five critical questions Azure Migrate cannot answer: (1) What's the 3-year Total Cost of Ownership (TCO) versus current datacenter including hidden costs? Azure Migrate estimates Azure consumption but omits support contracts, vendor fees, training, and organizational change costs. (2) What's the financial risk if migration fails or costs exceed estimates? Need risk-adjusted budget ranges, not single-point estimates. (3) When can we exit datacenter contracts and eliminate those costs? Requires vendor contract analysis and termination clause review. (4) What's the opportunity cost of this migration versus other IT initiatives? Requires business impact assessment beyond technical feasibility. (5) How do we validate ongoing Azure costs won't spiral without proper FinOps governance? Requires cost management framework before migration starts. CFOs block migrations when technical assessments don't address financial risk and organizational readiness."
      }
    },
    {
      "@type": "Question",
      "name": "How do I identify all dependencies for an application before Azure migration?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Identify application dependencies through five complementary methods: (1) Azure Migrate dependency analysis (agent-based or agentless) showing network connections between servers, (2) Application owner interviews documenting known integrations and data flows, (3) Network traffic analysis capturing actual communication patterns over 30+ days, (4) Database connection string analysis in application configs and connection pools, (5) Service account permissions audit showing what systems each app can access. Common hidden dependencies: shared file servers, centralized authentication systems, legacy batch jobs, middleware message queues, and external vendor APIs. Plan minimum 30-day observation period to capture monthly/quarterly processes. Document dependencies in migration wave planning - simultaneous migration of dependent systems reduces failure risk from 40% to 15%."
      }
    },
    {
      "@type": "Question",
      "name": "What licensing issues cause Azure migration audit failures?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Five licensing issues cause Azure migration audit failures: (1) OEM licenses that came with Dell/HP/Lenovo servers don't transfer to Azure - require new Volume Licenses with Software Assurance for Azure Hybrid Benefit, (2) SQL Server licensing audit failures when CAL-based on-premises becomes vCore-based in Azure without proper conversion documentation, (3) Third-party application licenses that prohibit cloud deployment or require expensive cloud licensing upgrades, (4) Windows Server Standard licenses that covered unlimited VMs on physical hosts now require individual licensing per Azure VM, (5) Software Assurance (SA) expiration between migration planning and execution invalidating Azure Hybrid Benefit eligibility. Average audit penalty: $50K-$200K for mid-sized environments. Complete licensing audit 6+ months before migration with legal review of all vendor agreements."
      }
    },
    {
      "@type": "Question",
      "name": "Should I use Azure Migrate for enterprise cloud migration planning?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Use Azure Migrate for technical discovery and sizing AFTER completing organizational readiness. Azure Migrate excels at: (1) VM inventory and right-sizing recommendations, (2) Performance-based sizing using actual CPU/memory utilization, (3) Azure cost estimates based on current usage patterns, (4) Dependency mapping for application grouping. However, Azure Migrate CANNOT answer: (1) Who owns this application and will they support cloud migration? (2) What vendor contracts must be modified or terminated? (3) What compliance requirements affect cloud deployment? (4) What's the true 3-year TCO including hidden costs? (5) What's the organizational change management plan? Start with the 55-question organizational readiness checklist. If you can't answer questions about ownership, licensing, and vendor relationships, Azure Migrate technical output is premature. Technical assessment without organizational readiness causes 60% of migration failures."
      }
    }
  ]
}
